{
   "navbar": [
      { "title": "Home", "href": "#home", "isActive": true },
      { "title": "About", "href": "#about", "isActive": true },
      { "title": "Experience", "href": "#experience", "isActive": true },
      { "title": "Projects", "href": "#projects", "isActive": true },
      { "title": "Technologies", "href": "#technologies", "isActive": true },
      { "title": "Contact", "href": "#contact", "isActive": true }
   ],
   "home": {
      "header": "Hey, I'm    John Angelo!",
      "subheader": "Explore my digital world and discover my passions!",
      "avatar": "/avatar.png",
      "hoverMessages": [
         "Hi there! I'm a Full Stack Developer.",
         "Passionate about creating seamless user experiences.",
         "Always curious and seeking continuous improvement through learning.",
         "Driven by a love for solving problems with digital solutions."
      ]
   },
   "projects": {
      "header": "A Selection of My Recent Work",
      "subheader": "Discover my user-focused digital solutions that solve real-world problems and streamline processes.",
      "projects": [
         {
            "id": 4,
            "title": "War Generator",
            "projectType": ["Web App", "Automation", "Report Generator", "Business Tool"],
            "description": "A web application designed to automate the generation of weekly accomplishment reports by retrieving data from the Clockify API and formatting it into standardized Excel reports.",
            "informations": [
               "Integrates with the Clockify API to automate data retrieval for report generation.",
               "Seamlessly integrates with Google Drive API for automated storage and management of generated reports.",
               "Automatically sends generated reports to HR or other stakeholders in real-time via email.",
               "Utilizes dynamic UI components that adapt based on user input and data for a personalized experience.",
               "Employs robust state management using Pinia to ensure data consistency across components.",
               "Implements comprehensive error handling with real-time notifications to alert users of issues during report generation or data retrieval.",
               "Future plans to integrate Slack Webhook for automatic report distribution to designated Slack channels.",
               "Developed with a modern tech stack including Nuxt 3, TypeScript, Tailwind CSS, and Ant Design."
            ],
            "techStacks": [
               { "label": "Nuxt 3", "icon": "/brand/nuxt.svg" },
               { "label": "Shadcn", "icon": "/brand/shadcn.svg" },
               { "label": "TypeScript", "icon": "/brand/typescript.svg" },
               { "label": "Tailwind CSS", "icon": "/brand/tailwindcss.svg" },
               { "label": "Pinia", "icon": "/brand/pinia.svg" },
               { "label": "Clockify API", "icon": "/brand/clockify.svg" },
               { "label": "Google Drive API", "icon": "/brand/google-drive.svg" }
            ],
            "githubLink": "https://github.com/code-jas/war-generator",
            "liveSiteLink": "https://war-generator.code-jas.me/",
            "bgImage": "/backgrounds/gradient-part-bg.png",
            "coverImage": "/covers/war-generator-cover.png",
            "mockupImage": "/mockups/war-generator-mockup.jpg",
            "staticPreview": false
         },
         {
            "id": 3,
            "title": "Internship Project Compilation",
            "projectType": ["Web App", "Mobile App", "Game Development", "API Integration"],
            "description": "A collection of small projects developed during my internship, showcasing a diverse range of skills including web and mobile app development, game development, and API integration.",
            "isCollection": true,
            "techStacks": [
               { "label": "Vue.js", "icon": "/brand/vue-js.svg" },
               { "label": "Nuxt.js", "icon": "/brand/nuxt.svg" },
               { "label": "Tailwind CSS", "icon": "/brand/tailwindcss.svg" },
               { "label": "Node.js", "icon": "/brand/node-js.svg" },
               { "label": "Flutter", "icon": "/brand/flutter.svg" },
               { "label": "Dart", "icon": "/brand/dart.svg" },
               { "label": "Firebase", "icon": "/brand/firebase.svg" }
            ],
            "bgImage": "/backgrounds/gradient-part-bg.png",
            "coverImage": "/mockups/wim-game-mockup.png",
            "informations": [""],
            "subprojects": [
               {
                  "title": "WIM Game Project",
                  "projectType": ["Web App", "Game Development", "Educational"],
                  "description": "An engaging and fun game to challenge your matching skills! Word/Image Match is a visual puzzle game where players match images to corresponding words. This project was developed as part of my internship, focusing on creating an educational web application that tests and improves visual and vocabulary skills.",
                  "informations": [
                     "Developed with Vue.js and Nuxt.js to ensure a fast and responsive user experience.",
                     "Implemented various levels of difficulty to cater to both beginners and advanced players.",
                     "Features a ranking dashboard to view user ranks and compare scores.",
                     "Includes dark mode and light mode to reduce eye strain and accommodate different lighting preferences.",
                     "Uses Local Storage to save your score between sessions.",
                     "Elaborate user interface designed for a seamless and engaging user experience."
                  ],
                  "techStacks": [
                     { "label": "Vue.js", "icon": "/brand/vue-js.svg" },
                     { "label": "Nuxt.js", "icon": "/brand/nuxt.svg" },
                     { "label": "Tailwind CSS", "icon": "/brand/tailwindcss.svg" }
                  ],
                  "githubLink": "https://github.com/code-jas/wim-game-project",
                  "mockupImage": "/mockups/wim-game-mockup.png",
                  "staticPreview": true
               },
               {
                  "title": "Flutter LMS App",
                  "projectType": ["Mobile App", "Learning Management System", "Educational"],
                  "description": "A Learning Management System built using Flutter, designed to offer a comprehensive platform for managing and exploring educational courses. This app provides users with the ability to sign up, explore courses, track progress, and manage their profiles with a seamless and user-friendly interface.",
                  "informations": [
                     "Implemented user authentication using the Google Sign-In library for easy and secure login.",
                     "Features a bottom navigation bar for easy navigation between Home, Explore, My Courses, and Account screens.",
                     "Home screen includes StatusCard widgets and a list of courses, providing an overview of the user's progress.",
                     "Explore screen offers search and filtering capabilities, allowing users to find courses based on categories.",
                     "My Courses screen features tabs for In Progress and Completed courses, with detailed tracking of user progress.",
                     "Account screen includes profile management, account settings, support, and sign-out options.",
                     "Course Details screen provides comprehensive information about each course, including the course header, description, author profile, and options to join or view more details.",
                     "Implemented a structured project directory for easy management and scalability of the application."
                  ],
                  "techStacks": [
                     { "label": "Flutter", "icon": "/brand/flutter.svg" },
                     { "label": "Dart", "icon": "/brand/dart.svg" },
                     { "label": "Firebase", "icon": "/brand/firebase.svg" }
                  ],
                  "githubLink": "https://github.com/code-jas/flutter_lms_app",
                  "mockupImage": "/mockups/flutter-lms-mockup.png",
                  "staticPreview": true
               },
               {
                  "title": "File Uploader (Vue & Express)",
                  "projectType": ["Web App", "API Integration"],
                  "description": "A web application for chunked file uploads, integrating Vue.js for the frontend and Express.js for the backend. This project demonstrates efficient file handling and server-client communication.",
                  "informations": [
                     "Implemented chunked file uploads to handle large files efficiently.",
                     "Frontend developed with Vue.js for a reactive and dynamic user interface.",
                     "Backend built with Express.js to handle file processing and storage.",
                     "Ensured secure file handling with validation and error handling mechanisms."
                  ],
                  "techStacks": [
                     { "label": "Vue.js", "icon": "/brand/vue-js.svg" },
                     { "label": "Node.js", "icon": "/brand/node-js.svg" }
                  ],
                  "githubLink": "https://github.com/code-jas/file-uploader-vue-express",
                  "coverImage": "/covers/file-uploader-cover.png",
                  "staticPreview": true
               },
               {
                  "title": "Flutter Profile",
                  "projectType": ["Mobile App", "Portfolio"],
                  "description": "A portfolio application developed using Flutter, showcasing my skills, projects, and experience in a sleek and responsive design.",
                  "informations": [
                     "Designed and developed using Flutter, ensuring cross-platform compatibility.",
                     "Includes sections for skills, experience, and project showcases.",
                     "Focused on creating a user-friendly and visually appealing interface.",
                     "Implemented responsive layouts to adapt to various screen sizes."
                  ],
                  "techStacks": [
                     { "label": "Flutter", "icon": "/brand/flutter.svg" },
                     { "label": "Dart", "icon": "/brand/dart.svg" },
                     { "label": "Firebase", "icon": "/brand/firebase.svg" }
                  ],
                  "githubLink": "https://github.com/code-jas/flutter_profile",
                  "coverImage": "/covers/flutter-profile-cover.png",
                  "staticPreview": true
               }
            ]
         },

         {
            "id": 2,
            "title": "Bookly",
            "projectType": ["Web App", "E-commerce", "Marketplace", "Bookstore"],
            "description": "A digital marketplace for secondhand books in the Philippines, making affordable literature accessible through an organized online platform.",
            "informations": [
               "Currently a work in progress as the platform is being migrated to Next.js.",
               "Built using React, Vite, Tailwind CSS, Node.js, Sequelize, and PostgreSQL, ensuring a robust and scalable platform.",
               "Will Deploy on Digital Ocean with Docker for seamless and efficient hosting.",
               "Supports dynamic roles for Admin, Buyer, and Seller, enhancing user experience.",
               "Real-time notifications and updates implemented using Socket.io.",
               "Efficient state management for a responsive user interface.",
               "Designed with Figma, focusing on intuitive and visually appealing UI/UX.",
               "Secure authentication with options for social media integration.",
               "Admins can manage book listings, including adding, editing, and removing books.",
               "Buyers and Sellers can manage their orders seamlessly, with real-time updates.",
               "Advanced search and filtering options for easy book discovery."
            ],
            "techStacks": [
               { "label": "React", "icon": "/brand/react.svg" },
               { "label": "Vite", "icon": "/brand/vite.svg" },
               { "label": "Node.js", "icon": "/brand/node-js.svg" },
               { "label": "Sequelize", "icon": "/brand/sequelize.svg" },
               { "label": "Digital Ocean", "icon": "/brand/digital-ocean.svg" },
               { "label": "PostgreSQL", "icon": "/brand/postgresql.svg" },
               { "label": "Docker", "icon": "/brand/docker.svg" }
            ],
            "githubLink": "https://github.com/code-jas/bookly-client",
            "bgImage": "/backgrounds/gradient-part-bg.png",
            "coverImage": "/covers/bookly-cover.png",
            "mockupImage": "/mockups/bookly-mockup.png",
            "staticPreview": true,
            "srcPreview": "/covers/bookly-cover.png"
         },
         {
            "id": 1,
            "title": "Ph Festival",
            "projectType": ["Web App", "Cultural Showcase", "Festival Guide", "Educational Blog"],
            "description": "Experience the vibrancy of Filipino culture through its diverse and colorful festivals. Share our similarities, celebrate our differences.",
            "informations": [
               "Ph Festival is my first web application project from college.",
               "I designed it using Figma to ensure a visually appealing and user-friendly interface.",
               "The goal was to showcase Philippine festivals with a focus on aesthetics and user experience.",
               "This application educates readers about various annual festivals in the Philippines.",
               "The app features vibrant galleries, timelines, detailed pages, animations, search, and filters for an enhanced experience.",
               "Developed using Next.js, Tailwind CSS, Redux, Prisma, and MongoDB.",
               "Focused on better structure, state management, data fetching, UI enhancements, and responsiveness."
            ],
            "techStacks": [
               { "label": "Next.js", "icon": "/brand/next-js.svg" },
               { "label": "TypeScript", "icon": "/brand/typescript.svg" },
               { "label": "Redux", "icon": "/brand/redux.svg" },
               { "label": "CSS", "icon": "/brand/css.svg" },
               { "label": "Prisma", "icon": "/brand/prisma.svg" },
               { "label": "Vercel", "icon": "/brand/vercel.svg" }
            ],
            "liveSiteLink": "https://ph-festival.code-jas.me",
            "bgImage": "/backgrounds/gradient-part-bg.png",
            "coverImage": "/covers/ph-festival-cover.png",
            "mockupImage": "/mockups/ph-festival-mockup.jpg"
         }
      ]
   },
   "experience": {
      "header": "Experience",
      "subheader": "Highlights of My Professional Journey",
      "timeline": [
         {
            "company": "Centralized Cloud Computing International Inc.",
            "url": "https://centralizedinc.com/",
            "roles": [
               {
                  "title": "Full Stack Developer",
                  "startDate": "August 2023",
                  "endDate": "Present",
                  "descriptions": [
                     "Led the front-end migration from Nuxt 2 to Nuxt 3, creating dynamic composables and components to eliminate redundancy, and implemented TypeScript for improved code maintainability and scalability.",
                     "Utilized a service-oriented MVC architecture with microservices using Node.js and TypeScript, enhancing code maintainability and scalability across the system.",
                     "Architected and managed complex database structures utilizing Sequelize and PostgreSQL, including the design of relational diagrams that optimized data retrieval and enabled fast access to data.",
                     "Designed and crafted intuitive mobile interfaces using Flutter, optimizing cross-platform usability and enhancing user engagement.",
                     "Led the development team in deploying applications through GitLab CI/CD pipelines, containerizing applications using Docker to streamline deployment processes, and enhancing scalability and reliability in production environments.",
                     "Resolved client issues by proactively monitoring and supporting application VMs and client apps, ensuring seamless application performance and addressing concerns as they arose."
                  ]
               },
               {
                  "title": "Student Intern",
                  "startDate": "March 2023",
                  "endDate": "August 2023",
                  "descriptions": [
                     "Acquired hands-on experience in both web and mobile development during an immersive internship, leveraging cutting-edge technologies to build innovative solutions.",
                     "Mastered Vue.js and NuxtJS for front-end development, designing and implementing interactive and responsive user interfaces for a diverse array of projects, including games, portfolio websites, and chunk upload functionalities.",
                     "Collaborated as a crucial team member on the development of a client-based Learning Management System (LMS) mobile application, contributing to the completion of essential modules and ensuring the timely delivery of high-quality features.",
                     "Developed mobile applications using Flutter and Dart, creating cross-platform apps with a single codebase to enhance development efficiency and application performance.",
                     "Utilized Git and GitLab for version control, maintaining code integrity and supporting seamless team collaboration throughout the development lifecycle."
                  ]
               }
            ]
         }
      ]
   },
   "technologies": {
      "header": "Technologies & Skills",
      "subheader": "Empowering development with these essential tools and frameworks.",
      "technologies": [
         [
            "typescript",
            "javascript",
            "react",
            "redux",
            "vite",
            "vuedotjs",
            "nextdotjs",
            "nuxtdotjs",
            "tailwindcss",
            "antdesign",
            "html5",
            "css3",
            "flutter",
            "figma"
         ],
         [
            "nodedotjs",
            "express",
            "python",
            "prisma",
            "mysql",
            "postgresql",
            "mongodb",
            "firebase",
            "docker",
            "vercel",
            "digitalocean",
            "git",
            "github",
            "gitlab"
         ]
      ]
   },
   "about": {
      "header": "About me",
      "subheader": "Web development is my innovative space, where I push boundaries and explore new horizons, and turn creative ideas into reality",
      "content": [
         {
            "title": "How My Creative Journey Began",
            "text": [
               "I started my creative journey in high school, using Photoshop to create graphic designs, edit and retouch photos, and design print and marketing materials. The magic of **highlight**transforming ideas into captivating visuals**highlight** sparked my passion for visual art and design."
            ],
            "image": "/about-images/about-01.jpg"
         },
         {
            "title": "Jumping into Web Development",
            "text": [
               "One day, while diving deep into the design world, I discovered UI/UX design in web applications, which immediately caught my interest. I began studying how to design simple applications and became curious about bringing these designs to life, **highlight**leading me to explore web development driven by my curiosity, creativity, and willingness to learn.**highlight**",
               "I started with HTML, CSS, and JavaScript, then advanced to frameworks like React and Vue, and also learned Android development. Eventually, I expanded my skills to back-end technologies like Node.js and Java Spring. This comprehensive knowledge helped me secure my first full-time job as a full-stack developer, a pivotal moment in my career."
            ],
            "image": "/about-images/about-02.jpg"
         },
         {
            "title": "What I’m Focused on Now",
            "text": [
               "These days, I work as a Full Stack Developer at Centralized Cloud Computing International Inc., where I **highlight**help deliver digital solutions for our clients’ web and mobile applications.**highlight**",
               "In my free time, I enjoy creative coding and reading, always exploring new technologies and honing my coding skills. I also love spending time with my friends and family, savoring life’s pleasures away from the computer screen when I’m not deeply immersed in coding or working out."
            ],
            "image": "/about-images/about-03.jpg"
         },
         {
            "title": "My Roadmap Ahead",
            "text": [
               "My aim is to **highlight**lead large-scale and secure projects, mentor junior developers, and make critical architectural decisions**highlight**. I strive to oversee development teams effectively, contribute impactful tech strategies aligned with business goals, and help establish the company as a leader in its field.",
               "To achieve this, I am passionate about continuously thinking of and developing innovative digital solutions. My focus is on creating as many valuable projects as possible, honing my skills, and expanding my knowledge. By doing so, I can lay a solid foundation for leading major initiatives and driving technological advancements within the organization."
            ],
            "image": "/about-images/about-04.jpg"
         }
      ]
   },
   "contact": {
      "header": "Let's keep in touch",
      "description": "Eager to share my tech insights and business know-how as I continue learning and applying my skills. Let’s connect!",
      "email": "johnangelo.silvestre04@gmail.com",
      "emailButtonLabel": "Send Email",
      "emailButtonClasses": "text-white bg-primary rounded-full px-8 p-3 font-medium transition duration-400 hover:bg-surface",
      "socialMessage": "Connect with me on my socials.",
      "social": [
         {
            "url": "https://www.linkedin.com/in/johnangelo-silvestre/",
            "icon": "FaLinkedin",
            "hoverColor": "hover:text-[#0e76a8]",
            "static": true,
            "imgSrc": "/link-preview/linkedin-preview.png",
            "preview": true
         },
         {
            "url": "https://discordapp.com/users/742020338270863450",
            "icon": "FaDiscord",
            "hoverColor": "hover:text-[#5865F2]",
            "static": false,
            "imgSrc": "/link-preview/github.svg",
            "preview": true
         },
         {
            "url": "https://github.com/code-jas",
            "icon": "FaGithub",
            "hoverColor": "hover:text-[#24292e]",
            "static": false,
            "imgSrc": "/link-preview/github.svg",
            "preview": true
         },
         {
            "url": "https://www.facebook.com/angelobsilvestre",
            "icon": "FaFacebook",
            "hoverColor": "hover:text-[#1877F2]",
            "static": true,
            "imgSrc": "/link-preview/fb-preview.png",
            "preview": true
         }
      ]
   },
   "footer": {
      "builtWith": [
         {
            "name": "Next.js",
            "url": "https://nextjs.org",
            "icon": "/brand/next-js.svg",
            "class": "icon-container next-icon"
         },
         {
            "name": "Vercel",
            "url": "https://vercel.com",
            "icon": "/brand/vercel.svg",
            "class": "icon-container vercel-icon"
         }
      ],
      "copyright": "John Angelo Silvestre"
   }
}
