{
   "projects": [
      {
         "id": 2,
         "title": "Bookly",
         "projectType": ["Web App", "E-commerce", "Marketplace", "Bookstore"],
         "description":
            "A digital marketplace for secondhand books in the Philippines, making affordable literature accessible through an organized online platform.",
         "informations": [
            "Built using React, Vite, Tailwind CSS, Node.js, Sequelize, and PostgreSQL, ensuring a robust and scalable platform.",
            "Deployed on Digital Ocean with Docker for seamless and efficient hosting.",
            "Supports dynamic roles for Admin, Buyer, and Seller, enhancing user experience.",
            "Real-time notifications and updates implemented using Socket.io.",
            "Efficient state management for a responsive user interface.",
            "Designed with Figma, focusing on intuitive and visually appealing UI/UX.",
            "Secure authentication with options for social media integration.",
            "Admins can manage book listings, including adding, editing, and removing books.",
            "Buyers and Sellers can manage their orders seamlessly, with real-time updates.",
            "Advanced search and filtering options for easy book discovery."
         ],
         "techStacks": [
            { "label": "React", "icon": "/brand/react.svg" },
            { "label": "Vite", "icon": "/brand/vite.svg" },
            { "label": "Node.js", "icon": "/brand/node-js.svg" },
            { "label": "Sequelize", "icon": "/brand/sequelize.svg" },
            { "label": "Digital Ocean", "icon": "/brand/digital-ocean.svg" },
            { "label": "PostgreSQL", "icon": "/brand/postgresql.svg" },
            { "label": "Docker", "icon": "/brand/docker.svg" }
         ],
         "liveSiteLink": "https://example.com/live-site-link-2",
         "bgImage": "/gradient-part-bg.png",
         "coverImage": "COMINGSOON",
         "mockupImage": "/test.jpg"
      },
      {
         "id": 1,
         "title": "Ph Festival",
         "projectType": ["Web App", "Cultural Showcase", "Festival Guide", "Educational Blog"],
         "description":
            "Experience the vibrancy of Filipino culture through its diverse and colorful festivals. Share our similarities, celebrate our differences.",
         "informations": [
            "Ph Festival is my first web application project from college.",
            "I designed it using Figma to ensure a visually appealing and user-friendly interface.",
            "The goal was to showcase Philippine festivals with a focus on aesthetics and user experience.",
            "This application educates readers about various annual festivals in the Philippines.",
            "The app features vibrant galleries, timelines, detailed pages, animations, search, and filters for an enhanced experience.",
            "Developed using Next.js, Tailwind CSS, Redux, Prisma, and MongoDB.",
            "Focused on better structure, state management, data fetching, UI enhancements, and responsiveness."
         ],
         "techStacks": [
            { "label": "Next.js", "icon": "/brand/next-js.svg" },
            { "label": "TypeScript", "icon": "/brand/typescript.svg" },
            { "label": "Redux", "icon": "/brand/redux.svg" },
            { "label": "CSS", "icon": "/brand/css.svg" },
            { "label": "Prisma", "icon": "/brand/prisma.svg" },
            { "label": "Vercel", "icon": "/brand/vercel.svg" }
         ],
         "liveSiteLink": "https://ph-festival.code-jas.me",
         "bgImage": "/gradient-part-bg.png",
         "coverImage": "/ph-festival-screenshot.png",
         "mockupImage": "/ph-festival-mockup.jpg"
      }
   ]
}
